FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20j17.h
/**
 * \file
 *
 * \brief Peripheral I/O description for SAMD20J17
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20J17_PIO_
#define _SAMD20J17_PIO_

#define PIN_PA00                     0            /**< \brief Pin Number for PA00 */
#define PORT_PA00                    ( 1u << 0 )  /**< \brief PORT Mask  for PA00 */
#define PIN_PA01                     1            /**< \brief Pin Number for PA01 */
#define PORT_PA01                    ( 1u << 1 )  /**< \brief PORT Mask  for PA01 */
#define PIN_PA02                     2            /**< \brief Pin Number for PA02 */
#define PORT_PA02                    ( 1u << 2 )  /**< \brief PORT Mask  for PA02 */
#define PIN_PA03                     3            /**< \brief Pin Number for PA03 */
#define PORT_PA03                    ( 1u << 3 )  /**< \brief PORT Mask  for PA03 */
#define PIN_PA04                     4            /**< \brief Pin Number for PA04 */
#define PORT_PA04                    ( 1u << 4 )  /**< \brief PORT Mask  for PA04 */
#define PIN_PA05                     5            /**< \brief Pin Number for PA05 */
#define PORT_PA05                    ( 1u << 5 )  /**< \brief PORT Mask  for PA05 */
#define PIN_PA06                     6            /**< \brief Pin Number for PA06 */
#define PORT_PA06                    ( 1u << 6 )  /**< \brief PORT Mask  for PA06 */
#define PIN_PA07                     7            /**< \brief Pin Number for PA07 */
#define PORT_PA07                    ( 1u << 7 )  /**< \brief PORT Mask  for PA07 */
#define PIN_PA08                     8            /**< \brief Pin Number for PA08 */
#define PORT_PA08                    ( 1u << 8 )  /**< \brief PORT Mask  for PA08 */
#define PIN_PA09                     9            /**< \brief Pin Number for PA09 */
#define PORT_PA09                    ( 1u << 9 )  /**< \brief PORT Mask  for PA09 */
#define PIN_PA10                     10           /**< \brief Pin Number for PA10 */
#define PORT_PA10                    ( 1u << 10 ) /**< \brief PORT Mask  for PA10 */
#define PIN_PA11                     11           /**< \brief Pin Number for PA11 */
#define PORT_PA11                    ( 1u << 11 ) /**< \brief PORT Mask  for PA11 */
#define PIN_PA12                     12           /**< \brief Pin Number for PA12 */
#define PORT_PA12                    ( 1u << 12 ) /**< \brief PORT Mask  for PA12 */
#define PIN_PA13                     13           /**< \brief Pin Number for PA13 */
#define PORT_PA13                    ( 1u << 13 ) /**< \brief PORT Mask  for PA13 */
#define PIN_PA14                     14           /**< \brief Pin Number for PA14 */
#define PORT_PA14                    ( 1u << 14 ) /**< \brief PORT Mask  for PA14 */
#define PIN_PA15                     15           /**< \brief Pin Number for PA15 */
#define PORT_PA15                    ( 1u << 15 ) /**< \brief PORT Mask  for PA15 */
#define PIN_PA16                     16           /**< \brief Pin Number for PA16 */
#define PORT_PA16                    ( 1u << 16 ) /**< \brief PORT Mask  for PA16 */
#define PIN_PA17                     17           /**< \brief Pin Number for PA17 */
#define PORT_PA17                    ( 1u << 17 ) /**< \brief PORT Mask  for PA17 */
#define PIN_PA18                     18           /**< \brief Pin Number for PA18 */
#define PORT_PA18                    ( 1u << 18 ) /**< \brief PORT Mask  for PA18 */
#define PIN_PA19                     19           /**< \brief Pin Number for PA19 */
#define PORT_PA19                    ( 1u << 19 ) /**< \brief PORT Mask  for PA19 */
#define PIN_PA20                     20           /**< \brief Pin Number for PA20 */
#define PORT_PA20                    ( 1u << 20 ) /**< \brief PORT Mask  for PA20 */
#define PIN_PA21                     21           /**< \brief Pin Number for PA21 */
#define PORT_PA21                    ( 1u << 21 ) /**< \brief PORT Mask  for PA21 */
#define PIN_PA22                     22           /**< \brief Pin Number for PA22 */
#define PORT_PA22                    ( 1u << 22 ) /**< \brief PORT Mask  for PA22 */
#define PIN_PA23                     23           /**< \brief Pin Number for PA23 */
#define PORT_PA23                    ( 1u << 23 ) /**< \brief PORT Mask  for PA23 */
#define PIN_PA24                     24           /**< \brief Pin Number for PA24 */
#define PORT_PA24                    ( 1u << 24 ) /**< \brief PORT Mask  for PA24 */
#define PIN_PA25                     25           /**< \brief Pin Number for PA25 */
#define PORT_PA25                    ( 1u << 25 ) /**< \brief PORT Mask  for PA25 */
#define PIN_PA27                     27           /**< \brief Pin Number for PA27 */
#define PORT_PA27                    ( 1u << 27 ) /**< \brief PORT Mask  for PA27 */
#define PIN_PA28                     28           /**< \brief Pin Number for PA28 */
#define PORT_PA28                    ( 1u << 28 ) /**< \brief PORT Mask  for PA28 */
#define PIN_PA30                     30           /**< \brief Pin Number for PA30 */
#define PORT_PA30                    ( 1u << 30 ) /**< \brief PORT Mask  for PA30 */
#define PIN_PA31                     31           /**< \brief Pin Number for PA31 */
#define PORT_PA31                    ( 1u << 31 ) /**< \brief PORT Mask  for PA31 */
#define PIN_PB00                     32           /**< \brief Pin Number for PB00 */
#define PORT_PB00                    ( 1u << 0 )  /**< \brief PORT Mask  for PB00 */
#define PIN_PB01                     33           /**< \brief Pin Number for PB01 */
#define PORT_PB01                    ( 1u << 1 )  /**< \brief PORT Mask  for PB01 */
#define PIN_PB02                     34           /**< \brief Pin Number for PB02 */
#define PORT_PB02                    ( 1u << 2 )  /**< \brief PORT Mask  for PB02 */
#define PIN_PB03                     35           /**< \brief Pin Number for PB03 */
#define PORT_PB03                    ( 1u << 3 )  /**< \brief PORT Mask  for PB03 */
#define PIN_PB04                     36           /**< \brief Pin Number for PB04 */
#define PORT_PB04                    ( 1u << 4 )  /**< \brief PORT Mask  for PB04 */
#define PIN_PB05                     37           /**< \brief Pin Number for PB05 */
#define PORT_PB05                    ( 1u << 5 )  /**< \brief PORT Mask  for PB05 */
#define PIN_PB06                     38           /**< \brief Pin Number for PB06 */
#define PORT_PB06                    ( 1u << 6 )  /**< \brief PORT Mask  for PB06 */
#define PIN_PB07                     39           /**< \brief Pin Number for PB07 */
#define PORT_PB07                    ( 1u << 7 )  /**< \brief PORT Mask  for PB07 */
#define PIN_PB08                     40           /**< \brief Pin Number for PB08 */
#define PORT_PB08                    ( 1u << 8 )  /**< \brief PORT Mask  for PB08 */
#define PIN_PB09                     41           /**< \brief Pin Number for PB09 */
#define PORT_PB09                    ( 1u << 9 )  /**< \brief PORT Mask  for PB09 */
#define PIN_PB10                     42           /**< \brief Pin Number for PB10 */
#define PORT_PB10                    ( 1u << 10 ) /**< \brief PORT Mask  for PB10 */
#define PIN_PB11                     43           /**< \brief Pin Number for PB11 */
#define PORT_PB11                    ( 1u << 11 ) /**< \brief PORT Mask  for PB11 */
#define PIN_PB12                     44           /**< \brief Pin Number for PB12 */
#define PORT_PB12                    ( 1u << 12 ) /**< \brief PORT Mask  for PB12 */
#define PIN_PB13                     45           /**< \brief Pin Number for PB13 */
#define PORT_PB13                    ( 1u << 13 ) /**< \brief PORT Mask  for PB13 */
#define PIN_PB14                     46           /**< \brief Pin Number for PB14 */
#define PORT_PB14                    ( 1u << 14 ) /**< \brief PORT Mask  for PB14 */
#define PIN_PB15                     47           /**< \brief Pin Number for PB15 */
#define PORT_PB15                    ( 1u << 15 ) /**< \brief PORT Mask  for PB15 */
#define PIN_PB16                     48           /**< \brief Pin Number for PB16 */
#define PORT_PB16                    ( 1u << 16 ) /**< \brief PORT Mask  for PB16 */
#define PIN_PB17                     49           /**< \brief Pin Number for PB17 */
#define PORT_PB17                    ( 1u << 17 ) /**< \brief PORT Mask  for PB17 */
#define PIN_PB22                     54           /**< \brief Pin Number for PB22 */
#define PORT_PB22                    ( 1u << 22 ) /**< \brief PORT Mask  for PB22 */
#define PIN_PB23                     55           /**< \brief Pin Number for PB23 */
#define PORT_PB23                    ( 1u << 23 ) /**< \brief PORT Mask  for PB23 */
#define PIN_PB30                     62           /**< \brief Pin Number for PB30 */
#define PORT_PB30                    ( 1u << 30 ) /**< \brief PORT Mask  for PB30 */
#define PIN_PB31                     63           /**< \brief Pin Number for PB31 */
#define PORT_PB31                    ( 1u << 31 ) /**< \brief PORT Mask  for PB31 */
/* ========== PORT definition for CORE peripheral ========== */
#define PIN_PA30G_CORE_SWCLK         30           /**< \brief CORE signal: SWCLK on PA30 mux G */
#define MUX_PA30G_CORE_SWCLK         6
#define PINMUX_PA30G_CORE_SWCLK      ( ( PIN_PA30G_CORE_SWCLK << 16 ) | MUX_PA30G_CORE_SWCLK )
#define PORT_PA30G_CORE_SWCLK        ( 1u << 30 )
/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_PB14H_GCLK_IO0           46       /**< \brief GCLK signal: IO0 on PB14 mux H */
#define MUX_PB14H_GCLK_IO0           7
#define PINMUX_PB14H_GCLK_IO0        ( ( PIN_PB14H_GCLK_IO0 << 16 ) | MUX_PB14H_GCLK_IO0 )
#define PORT_PB14H_GCLK_IO0          ( 1u << 14 )
#define PIN_PB22H_GCLK_IO0           54       /**< \brief GCLK signal: IO0 on PB22 mux H */
#define MUX_PB22H_GCLK_IO0           7
#define PINMUX_PB22H_GCLK_IO0        ( ( PIN_PB22H_GCLK_IO0 << 16 ) | MUX_PB22H_GCLK_IO0 )
#define PORT_PB22H_GCLK_IO0          ( 1u << 22 )
#define PIN_PA14H_GCLK_IO0           14       /**< \brief GCLK signal: IO0 on PA14 mux H */
#define MUX_PA14H_GCLK_IO0           7
#define PINMUX_PA14H_GCLK_IO0        ( ( PIN_PA14H_GCLK_IO0 << 16 ) | MUX_PA14H_GCLK_IO0 )
#define PORT_PA14H_GCLK_IO0          ( 1u << 14 )
#define PIN_PA27H_GCLK_IO0           27       /**< \brief GCLK signal: IO0 on PA27 mux H */
#define MUX_PA27H_GCLK_IO0           7
#define PINMUX_PA27H_GCLK_IO0        ( ( PIN_PA27H_GCLK_IO0 << 16 ) | MUX_PA27H_GCLK_IO0 )
#define PORT_PA27H_GCLK_IO0          ( 1u << 27 )
#define PIN_PA28H_GCLK_IO0           28       /**< \brief GCLK signal: IO0 on PA28 mux H */
#define MUX_PA28H_GCLK_IO0           7
#define PINMUX_PA28H_GCLK_IO0        ( ( PIN_PA28H_GCLK_IO0 << 16 ) | MUX_PA28H_GCLK_IO0 )
#define PORT_PA28H_GCLK_IO0          ( 1u << 28 )
#define PIN_PA30H_GCLK_IO0           30       /**< \brief GCLK signal: IO0 on PA30 mux H */
#define MUX_PA30H_GCLK_IO0           7
#define PINMUX_PA30H_GCLK_IO0        ( ( PIN_PA30H_GCLK_IO0 << 16 ) | MUX_PA30H_GCLK_IO0 )
#define PORT_PA30H_GCLK_IO0          ( 1u << 30 )
#define PIN_PB15H_GCLK_IO1           47       /**< \brief GCLK signal: IO1 on PB15 mux H */
#define MUX_PB15H_GCLK_IO1           7
#define PINMUX_PB15H_GCLK_IO1        ( ( PIN_PB15H_GCLK_IO1 << 16 ) | MUX_PB15H_GCLK_IO1 )
#define PORT_PB15H_GCLK_IO1          ( 1u << 15 )
#define PIN_PB23H_GCLK_IO1           55       /**< \brief GCLK signal: IO1 on PB23 mux H */
#define MUX_PB23H_GCLK_IO1           7
#define PINMUX_PB23H_GCLK_IO1        ( ( PIN_PB23H_GCLK_IO1 << 16 ) | MUX_PB23H_GCLK_IO1 )
#define PORT_PB23H_GCLK_IO1          ( 1u << 23 )
#define PIN_PA15H_GCLK_IO1           15       /**< \brief GCLK signal: IO1 on PA15 mux H */
#define MUX_PA15H_GCLK_IO1           7
#define PINMUX_PA15H_GCLK_IO1        ( ( PIN_PA15H_GCLK_IO1 << 16 ) | MUX_PA15H_GCLK_IO1 )
#define PORT_PA15H_GCLK_IO1          ( 1u << 15 )
#define PIN_PB16H_GCLK_IO2           48       /**< \brief GCLK signal: IO2 on PB16 mux H */
#define MUX_PB16H_GCLK_IO2           7
#define PINMUX_PB16H_GCLK_IO2        ( ( PIN_PB16H_GCLK_IO2 << 16 ) | MUX_PB16H_GCLK_IO2 )
#define PORT_PB16H_GCLK_IO2          ( 1u << 16 )
#define PIN_PA16H_GCLK_IO2           16       /**< \brief GCLK signal: IO2 on PA16 mux H */
#define MUX_PA16H_GCLK_IO2           7
#define PINMUX_PA16H_GCLK_IO2        ( ( PIN_PA16H_GCLK_IO2 << 16 ) | MUX_PA16H_GCLK_IO2 )
#define PORT_PA16H_GCLK_IO2          ( 1u << 16 )
#define PIN_PA17H_GCLK_IO3           17       /**< \brief GCLK signal: IO3 on PA17 mux H */
#define MUX_PA17H_GCLK_IO3           7
#define PINMUX_PA17H_GCLK_IO3        ( ( PIN_PA17H_GCLK_IO3 << 16 ) | MUX_PA17H_GCLK_IO3 )
#define PORT_PA17H_GCLK_IO3          ( 1u << 17 )
#define PIN_PB17H_GCLK_IO3           49       /**< \brief GCLK signal: IO3 on PB17 mux H */
#define MUX_PB17H_GCLK_IO3           7
#define PINMUX_PB17H_GCLK_IO3        ( ( PIN_PB17H_GCLK_IO3 << 16 ) | MUX_PB17H_GCLK_IO3 )
#define PORT_PB17H_GCLK_IO3          ( 1u << 17 )
#define PIN_PA10H_GCLK_IO4           10       /**< \brief GCLK signal: IO4 on PA10 mux H */
#define MUX_PA10H_GCLK_IO4           7
#define PINMUX_PA10H_GCLK_IO4        ( ( PIN_PA10H_GCLK_IO4 << 16 ) | MUX_PA10H_GCLK_IO4 )
#define PORT_PA10H_GCLK_IO4          ( 1u << 10 )
#define PIN_PA20H_GCLK_IO4           20       /**< \brief GCLK signal: IO4 on PA20 mux H */
#define MUX_PA20H_GCLK_IO4           7
#define PINMUX_PA20H_GCLK_IO4        ( ( PIN_PA20H_GCLK_IO4 << 16 ) | MUX_PA20H_GCLK_IO4 )
#define PORT_PA20H_GCLK_IO4          ( 1u << 20 )
#define PIN_PB10H_GCLK_IO4           42       /**< \brief GCLK signal: IO4 on PB10 mux H */
#define MUX_PB10H_GCLK_IO4           7
#define PINMUX_PB10H_GCLK_IO4        ( ( PIN_PB10H_GCLK_IO4 << 16 ) | MUX_PB10H_GCLK_IO4 )
#define PORT_PB10H_GCLK_IO4          ( 1u << 10 )
#define PIN_PA11H_GCLK_IO5           11       /**< \brief GCLK signal: IO5 on PA11 mux H */
#define MUX_PA11H_GCLK_IO5           7
#define PINMUX_PA11H_GCLK_IO5        ( ( PIN_PA11H_GCLK_IO5 << 16 ) | MUX_PA11H_GCLK_IO5 )
#define PORT_PA11H_GCLK_IO5          ( 1u << 11 )
#define PIN_PA21H_GCLK_IO5           21       /**< \brief GCLK signal: IO5 on PA21 mux H */
#define MUX_PA21H_GCLK_IO5           7
#define PINMUX_PA21H_GCLK_IO5        ( ( PIN_PA21H_GCLK_IO5 << 16 ) | MUX_PA21H_GCLK_IO5 )
#define PORT_PA21H_GCLK_IO5          ( 1u << 21 )
#define PIN_PB11H_GCLK_IO5           43       /**< \brief GCLK signal: IO5 on PB11 mux H */
#define MUX_PB11H_GCLK_IO5           7
#define PINMUX_PB11H_GCLK_IO5        ( ( PIN_PB11H_GCLK_IO5 << 16 ) | MUX_PB11H_GCLK_IO5 )
#define PORT_PB11H_GCLK_IO5          ( 1u << 11 )
#define PIN_PA22H_GCLK_IO6           22       /**< \brief GCLK signal: IO6 on PA22 mux H */
#define MUX_PA22H_GCLK_IO6           7
#define PINMUX_PA22H_GCLK_IO6        ( ( PIN_PA22H_GCLK_IO6 << 16 ) | MUX_PA22H_GCLK_IO6 )
#define PORT_PA22H_GCLK_IO6          ( 1u << 22 )
#define PIN_PB12H_GCLK_IO6           44       /**< \brief GCLK signal: IO6 on PB12 mux H */
#define MUX_PB12H_GCLK_IO6           7
#define PINMUX_PB12H_GCLK_IO6        ( ( PIN_PB12H_GCLK_IO6 << 16 ) | MUX_PB12H_GCLK_IO6 )
#define PORT_PB12H_GCLK_IO6          ( 1u << 12 )
#define PIN_PA23H_GCLK_IO7           23       /**< \brief GCLK signal: IO7 on PA23 mux H */
#define MUX_PA23H_GCLK_IO7           7
#define PINMUX_PA23H_GCLK_IO7        ( ( PIN_PA23H_GCLK_IO7 << 16 ) | MUX_PA23H_GCLK_IO7 )
#define PORT_PA23H_GCLK_IO7          ( 1u << 23 )
#define PIN_PB13H_GCLK_IO7           45       /**< \brief GCLK signal: IO7 on PB13 mux H */
#define MUX_PB13H_GCLK_IO7           7
#define PINMUX_PB13H_GCLK_IO7        ( ( PIN_PB13H_GCLK_IO7 << 16 ) | MUX_PB13H_GCLK_IO7 )
#define PORT_PB13H_GCLK_IO7          ( 1u << 13 )
/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA16A_EIC_EXTINT0        16       /**< \brief EIC signal: EXTINT0 on PA16 mux A */
#define MUX_PA16A_EIC_EXTINT0        0
#define PINMUX_PA16A_EIC_EXTINT0     ( ( PIN_PA16A_EIC_EXTINT0 << 16 ) | MUX_PA16A_EIC_EXTINT0 )
#define PORT_PA16A_EIC_EXTINT0       ( 1u << 16 )
#define PIN_PB00A_EIC_EXTINT0        32       /**< \brief EIC signal: EXTINT0 on PB00 mux A */
#define MUX_PB00A_EIC_EXTINT0        0
#define PINMUX_PB00A_EIC_EXTINT0     ( ( PIN_PB00A_EIC_EXTINT0 << 16 ) | MUX_PB00A_EIC_EXTINT0 )
#define PORT_PB00A_EIC_EXTINT0       ( 1u << 0 )
#define PIN_PB16A_EIC_EXTINT0        48       /**< \brief EIC signal: EXTINT0 on PB16 mux A */
#define MUX_PB16A_EIC_EXTINT0        0
#define PINMUX_PB16A_EIC_EXTINT0     ( ( PIN_PB16A_EIC_EXTINT0 << 16 ) | MUX_PB16A_EIC_EXTINT0 )
#define PORT_PB16A_EIC_EXTINT0       ( 1u << 16 )
#define PIN_PA00A_EIC_EXTINT0        0        /**< \brief EIC signal: EXTINT0 on PA00 mux A */
#define MUX_PA00A_EIC_EXTINT0        0
#define PINMUX_PA00A_EIC_EXTINT0     ( ( PIN_PA00A_EIC_EXTINT0 << 16 ) | MUX_PA00A_EIC_EXTINT0 )
#define PORT_PA00A_EIC_EXTINT0       ( 1u << 0 )
#define PIN_PA17A_EIC_EXTINT1        17       /**< \brief EIC signal: EXTINT1 on PA17 mux A */
#define MUX_PA17A_EIC_EXTINT1        0
#define PINMUX_PA17A_EIC_EXTINT1     ( ( PIN_PA17A_EIC_EXTINT1 << 16 ) | MUX_PA17A_EIC_EXTINT1 )
#define PORT_PA17A_EIC_EXTINT1       ( 1u << 17 )
#define PIN_PB01A_EIC_EXTINT1        33       /**< \brief EIC signal: EXTINT1 on PB01 mux A */
#define MUX_PB01A_EIC_EXTINT1        0
#define PINMUX_PB01A_EIC_EXTINT1     ( ( PIN_PB01A_EIC_EXTINT1 << 16 ) | MUX_PB01A_EIC_EXTINT1 )
#define PORT_PB01A_EIC_EXTINT1       ( 1u << 1 )
#define PIN_PB17A_EIC_EXTINT1        49       /**< \brief EIC signal: EXTINT1 on PB17 mux A */
#define MUX_PB17A_EIC_EXTINT1        0
#define PINMUX_PB17A_EIC_EXTINT1     ( ( PIN_PB17A_EIC_EXTINT1 << 16 ) | MUX_PB17A_EIC_EXTINT1 )
#define PORT_PB17A_EIC_EXTINT1       ( 1u << 17 )
#define PIN_PA01A_EIC_EXTINT1        1        /**< \brief EIC signal: EXTINT1 on PA01 mux A */
#define MUX_PA01A_EIC_EXTINT1        0
#define PINMUX_PA01A_EIC_EXTINT1     ( ( PIN_PA01A_EIC_EXTINT1 << 16 ) | MUX_PA01A_EIC_EXTINT1 )
#define PORT_PA01A_EIC_EXTINT1       ( 1u << 1 )
#define PIN_PA02A_EIC_EXTINT2        2        /**< \brief EIC signal: EXTINT2 on PA02 mux A */
#define MUX_PA02A_EIC_EXTINT2        0
#define PINMUX_PA02A_EIC_EXTINT2     ( ( PIN_PA02A_EIC_EXTINT2 << 16 ) | MUX_PA02A_EIC_EXTINT2 )
#define PORT_PA02A_EIC_EXTINT2       ( 1u << 2 )
#define PIN_PA18A_EIC_EXTINT2        18       /**< \brief EIC signal: EXTINT2 on PA18 mux A */
#define MUX_PA18A_EIC_EXTINT2        0
#define PINMUX_PA18A_EIC_EXTINT2     ( ( PIN_PA18A_EIC_EXTINT2 << 16 ) | MUX_PA18A_EIC_EXTINT2 )
#define PORT_PA18A_EIC_EXTINT2       ( 1u << 18 )
#define PIN_PB02A_EIC_EXTINT2        34       /**< \brief EIC signal: EXTINT2 on PB02 mux A */
#define MUX_PB02A_EIC_EXTINT2        0
#define PINMUX_PB02A_EIC_EXTINT2     ( ( PIN_PB02A_EIC_EXTINT2 << 16 ) | MUX_PB02A_EIC_EXTINT2 )
#define PORT_PB02A_EIC_EXTINT2       ( 1u << 2 )
#define PIN_PA03A_EIC_EXTINT3        3        /**< \brief EIC signal: EXTINT3 on PA03 mux A */
#define MUX_PA03A_EIC_EXTINT3        0
#define PINMUX_PA03A_EIC_EXTINT3     ( ( PIN_PA03A_EIC_EXTINT3 << 16 ) | MUX_PA03A_EIC_EXTINT3 )
#define PORT_PA03A_EIC_EXTINT3       ( 1u << 3 )
#define PIN_PA19A_EIC_EXTINT3        19       /**< \brief EIC signal: EXTINT3 on PA19 mux A */
#define MUX_PA19A_EIC_EXTINT3        0
#define PINMUX_PA19A_EIC_EXTINT3     ( ( PIN_PA19A_EIC_EXTINT3 << 16 ) | MUX_PA19A_EIC_EXTINT3 )
#define PORT_PA19A_EIC_EXTINT3       ( 1u << 19 )
#define PIN_PB03A_EIC_EXTINT3        35       /**< \brief EIC signal: EXTINT3 on PB03 mux A */
#define MUX_PB03A_EIC_EXTINT3        0
#define PINMUX_PB03A_EIC_EXTINT3     ( ( PIN_PB03A_EIC_EXTINT3 << 16 ) | MUX_PB03A_EIC_EXTINT3 )
#define PORT_PB03A_EIC_EXTINT3       ( 1u << 3 )
#define PIN_PA04A_EIC_EXTINT4        4        /**< \brief EIC signal: EXTINT4 on PA04 mux A */
#define MUX_PA04A_EIC_EXTINT4        0
#define PINMUX_PA04A_EIC_EXTINT4     ( ( PIN_PA04A_EIC_EXTINT4 << 16 ) | MUX_PA04A_EIC_EXTINT4 )
#define PORT_PA04A_EIC_EXTINT4       ( 1u << 4 )
#define PIN_PA20A_EIC_EXTINT4        20       /**< \brief EIC signal: EXTINT4 on PA20 mux A */
#define MUX_PA20A_EIC_EXTINT4        0
#define PINMUX_PA20A_EIC_EXTINT4     ( ( PIN_PA20A_EIC_EXTINT4 << 16 ) | MUX_PA20A_EIC_EXTINT4 )
#define PORT_PA20A_EIC_EXTINT4       ( 1u << 20 )
#define PIN_PB04A_EIC_EXTINT4        36       /**< \brief EIC signal: EXTINT4 on PB04 mux A */
#define MUX_PB04A_EIC_EXTINT4        0
#define PINMUX_PB04A_EIC_EXTINT4     ( ( PIN_PB04A_EIC_EXTINT4 << 16 ) | MUX_PB04A_EIC_EXTINT4 )
#define PORT_PB04A_EIC_EXTINT4       ( 1u << 4 )
#define PIN_PA05A_EIC_EXTINT5        5        /**< \brief EIC signal: EXTINT5 on PA05 mux A */
#define MUX_PA05A_EIC_EXTINT5        0
#define PINMUX_PA05A_EIC_EXTINT5     ( ( PIN_PA05A_EIC_EXTINT5 << 16 ) | MUX_PA05A_EIC_EXTINT5 )
#define PORT_PA05A_EIC_EXTINT5       ( 1u << 5 )
#define PIN_PA21A_EIC_EXTINT5        21       /**< \brief EIC signal: EXTINT5 on PA21 mux A */
#define MUX_PA21A_EIC_EXTINT5        0
#define PINMUX_PA21A_EIC_EXTINT5     ( ( PIN_PA21A_EIC_EXTINT5 << 16 ) | MUX_PA21A_EIC_EXTINT5 )
#define PORT_PA21A_EIC_EXTINT5       ( 1u << 21 )
#define PIN_PB05A_EIC_EXTINT5        37       /**< \brief EIC signal: EXTINT5 on PB05 mux A */
#define MUX_PB05A_EIC_EXTINT5        0
#define PINMUX_PB05A_EIC_EXTINT5     ( ( PIN_PB05A_EIC_EXTINT5 << 16 ) | MUX_PB05A_EIC_EXTINT5 )
#define PORT_PB05A_EIC_EXTINT5       ( 1u << 5 )
#define PIN_PA06A_EIC_EXTINT6        6        /**< \brief EIC signal: EXTINT6 on PA06 mux A */
#define MUX_PA06A_EIC_EXTINT6        0
#define PINMUX_PA06A_EIC_EXTINT6     ( ( PIN_PA06A_EIC_EXTINT6 << 16 ) | MUX_PA06A_EIC_EXTINT6 )
#define PORT_PA06A_EIC_EXTINT6       ( 1u << 6 )
#define PIN_PA22A_EIC_EXTINT6        22       /**< \brief EIC signal: EXTINT6 on PA22 mux A */
#define MUX_PA22A_EIC_EXTINT6        0
#define PINMUX_PA22A_EIC_EXTINT6     ( ( PIN_PA22A_EIC_EXTINT6 << 16 ) | MUX_PA22A_EIC_EXTINT6 )
#define PORT_PA22A_EIC_EXTINT6       ( 1u << 22 )
#define PIN_PB06A_EIC_EXTINT6        38       /**< \brief EIC signal: EXTINT6 on PB06 mux A */
#define MUX_PB06A_EIC_EXTINT6        0
#define PINMUX_PB06A_EIC_EXTINT6     ( ( PIN_PB06A_EIC_EXTINT6 << 16 ) | MUX_PB06A_EIC_EXTINT6 )
#define PORT_PB06A_EIC_EXTINT6       ( 1u << 6 )
#define PIN_PB22A_EIC_EXTINT6        54       /**< \brief EIC signal: EXTINT6 on PB22 mux A */
#define MUX_PB22A_EIC_EXTINT6        0
