FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20j17.h
#define PINMUX_PB22A_EIC_EXTINT6     ( ( PIN_PB22A_EIC_EXTINT6 << 16 ) | MUX_PB22A_EIC_EXTINT6 )
#define PORT_PB22A_EIC_EXTINT6       ( 1u << 22 )
#define PIN_PA07A_EIC_EXTINT7        7        /**< \brief EIC signal: EXTINT7 on PA07 mux A */
#define MUX_PA07A_EIC_EXTINT7        0
#define PINMUX_PA07A_EIC_EXTINT7     ( ( PIN_PA07A_EIC_EXTINT7 << 16 ) | MUX_PA07A_EIC_EXTINT7 )
#define PORT_PA07A_EIC_EXTINT7       ( 1u << 7 )
#define PIN_PA23A_EIC_EXTINT7        23       /**< \brief EIC signal: EXTINT7 on PA23 mux A */
#define MUX_PA23A_EIC_EXTINT7        0
#define PINMUX_PA23A_EIC_EXTINT7     ( ( PIN_PA23A_EIC_EXTINT7 << 16 ) | MUX_PA23A_EIC_EXTINT7 )
#define PORT_PA23A_EIC_EXTINT7       ( 1u << 23 )
#define PIN_PB07A_EIC_EXTINT7        39       /**< \brief EIC signal: EXTINT7 on PB07 mux A */
#define MUX_PB07A_EIC_EXTINT7        0
#define PINMUX_PB07A_EIC_EXTINT7     ( ( PIN_PB07A_EIC_EXTINT7 << 16 ) | MUX_PB07A_EIC_EXTINT7 )
#define PORT_PB07A_EIC_EXTINT7       ( 1u << 7 )
#define PIN_PB23A_EIC_EXTINT7        55       /**< \brief EIC signal: EXTINT7 on PB23 mux A */
#define MUX_PB23A_EIC_EXTINT7        0
#define PINMUX_PB23A_EIC_EXTINT7     ( ( PIN_PB23A_EIC_EXTINT7 << 16 ) | MUX_PB23A_EIC_EXTINT7 )
#define PORT_PB23A_EIC_EXTINT7       ( 1u << 23 )
#define PIN_PA28A_EIC_EXTINT8        28       /**< \brief EIC signal: EXTINT8 on PA28 mux A */
#define MUX_PA28A_EIC_EXTINT8        0
#define PINMUX_PA28A_EIC_EXTINT8     ( ( PIN_PA28A_EIC_EXTINT8 << 16 ) | MUX_PA28A_EIC_EXTINT8 )
#define PORT_PA28A_EIC_EXTINT8       ( 1u << 28 )
#define PIN_PB08A_EIC_EXTINT8        40       /**< \brief EIC signal: EXTINT8 on PB08 mux A */
#define MUX_PB08A_EIC_EXTINT8        0
#define PINMUX_PB08A_EIC_EXTINT8     ( ( PIN_PB08A_EIC_EXTINT8 << 16 ) | MUX_PB08A_EIC_EXTINT8 )
#define PORT_PB08A_EIC_EXTINT8       ( 1u << 8 )
#define PIN_PA09A_EIC_EXTINT9        9        /**< \brief EIC signal: EXTINT9 on PA09 mux A */
#define MUX_PA09A_EIC_EXTINT9        0
#define PINMUX_PA09A_EIC_EXTINT9     ( ( PIN_PA09A_EIC_EXTINT9 << 16 ) | MUX_PA09A_EIC_EXTINT9 )
#define PORT_PA09A_EIC_EXTINT9       ( 1u << 9 )
#define PIN_PB09A_EIC_EXTINT9        41       /**< \brief EIC signal: EXTINT9 on PB09 mux A */
#define MUX_PB09A_EIC_EXTINT9        0
#define PINMUX_PB09A_EIC_EXTINT9     ( ( PIN_PB09A_EIC_EXTINT9 << 16 ) | MUX_PB09A_EIC_EXTINT9 )
#define PORT_PB09A_EIC_EXTINT9       ( 1u << 9 )
#define PIN_PA10A_EIC_EXTINT10       10       /**< \brief EIC signal: EXTINT10 on PA10 mux A */
#define MUX_PA10A_EIC_EXTINT10       0
#define PINMUX_PA10A_EIC_EXTINT10    ( ( PIN_PA10A_EIC_EXTINT10 << 16 ) | MUX_PA10A_EIC_EXTINT10 )
#define PORT_PA10A_EIC_EXTINT10      ( 1u << 10 )
#define PIN_PA30A_EIC_EXTINT10       30       /**< \brief EIC signal: EXTINT10 on PA30 mux A */
#define MUX_PA30A_EIC_EXTINT10       0
#define PINMUX_PA30A_EIC_EXTINT10    ( ( PIN_PA30A_EIC_EXTINT10 << 16 ) | MUX_PA30A_EIC_EXTINT10 )
#define PORT_PA30A_EIC_EXTINT10      ( 1u << 30 )
#define PIN_PB10A_EIC_EXTINT10       42       /**< \brief EIC signal: EXTINT10 on PB10 mux A */
#define MUX_PB10A_EIC_EXTINT10       0
#define PINMUX_PB10A_EIC_EXTINT10    ( ( PIN_PB10A_EIC_EXTINT10 << 16 ) | MUX_PB10A_EIC_EXTINT10 )
#define PORT_PB10A_EIC_EXTINT10      ( 1u << 10 )
#define PIN_PA11A_EIC_EXTINT11       11       /**< \brief EIC signal: EXTINT11 on PA11 mux A */
#define MUX_PA11A_EIC_EXTINT11       0
#define PINMUX_PA11A_EIC_EXTINT11    ( ( PIN_PA11A_EIC_EXTINT11 << 16 ) | MUX_PA11A_EIC_EXTINT11 )
#define PORT_PA11A_EIC_EXTINT11      ( 1u << 11 )
#define PIN_PA31A_EIC_EXTINT11       31       /**< \brief EIC signal: EXTINT11 on PA31 mux A */
#define MUX_PA31A_EIC_EXTINT11       0
#define PINMUX_PA31A_EIC_EXTINT11    ( ( PIN_PA31A_EIC_EXTINT11 << 16 ) | MUX_PA31A_EIC_EXTINT11 )
#define PORT_PA31A_EIC_EXTINT11      ( 1u << 31 )
#define PIN_PB11A_EIC_EXTINT11       43       /**< \brief EIC signal: EXTINT11 on PB11 mux A */
#define MUX_PB11A_EIC_EXTINT11       0
#define PINMUX_PB11A_EIC_EXTINT11    ( ( PIN_PB11A_EIC_EXTINT11 << 16 ) | MUX_PB11A_EIC_EXTINT11 )
#define PORT_PB11A_EIC_EXTINT11      ( 1u << 11 )
#define PIN_PA12A_EIC_EXTINT12       12       /**< \brief EIC signal: EXTINT12 on PA12 mux A */
#define MUX_PA12A_EIC_EXTINT12       0
#define PINMUX_PA12A_EIC_EXTINT12    ( ( PIN_PA12A_EIC_EXTINT12 << 16 ) | MUX_PA12A_EIC_EXTINT12 )
#define PORT_PA12A_EIC_EXTINT12      ( 1u << 12 )
#define PIN_PA24A_EIC_EXTINT12       24       /**< \brief EIC signal: EXTINT12 on PA24 mux A */
#define MUX_PA24A_EIC_EXTINT12       0
#define PINMUX_PA24A_EIC_EXTINT12    ( ( PIN_PA24A_EIC_EXTINT12 << 16 ) | MUX_PA24A_EIC_EXTINT12 )
#define PORT_PA24A_EIC_EXTINT12      ( 1u << 24 )
#define PIN_PB12A_EIC_EXTINT12       44       /**< \brief EIC signal: EXTINT12 on PB12 mux A */
#define MUX_PB12A_EIC_EXTINT12       0
#define PINMUX_PB12A_EIC_EXTINT12    ( ( PIN_PB12A_EIC_EXTINT12 << 16 ) | MUX_PB12A_EIC_EXTINT12 )
#define PORT_PB12A_EIC_EXTINT12      ( 1u << 12 )
#define PIN_PA13A_EIC_EXTINT13       13       /**< \brief EIC signal: EXTINT13 on PA13 mux A */
#define MUX_PA13A_EIC_EXTINT13       0
#define PINMUX_PA13A_EIC_EXTINT13    ( ( PIN_PA13A_EIC_EXTINT13 << 16 ) | MUX_PA13A_EIC_EXTINT13 )
#define PORT_PA13A_EIC_EXTINT13      ( 1u << 13 )
#define PIN_PA25A_EIC_EXTINT13       25       /**< \brief EIC signal: EXTINT13 on PA25 mux A */
#define MUX_PA25A_EIC_EXTINT13       0
#define PINMUX_PA25A_EIC_EXTINT13    ( ( PIN_PA25A_EIC_EXTINT13 << 16 ) | MUX_PA25A_EIC_EXTINT13 )
#define PORT_PA25A_EIC_EXTINT13      ( 1u << 25 )
#define PIN_PB13A_EIC_EXTINT13       45       /**< \brief EIC signal: EXTINT13 on PB13 mux A */
#define MUX_PB13A_EIC_EXTINT13       0
#define PINMUX_PB13A_EIC_EXTINT13    ( ( PIN_PB13A_EIC_EXTINT13 << 16 ) | MUX_PB13A_EIC_EXTINT13 )
#define PORT_PB13A_EIC_EXTINT13      ( 1u << 13 )
#define PIN_PB14A_EIC_EXTINT14       46       /**< \brief EIC signal: EXTINT14 on PB14 mux A */
#define MUX_PB14A_EIC_EXTINT14       0
#define PINMUX_PB14A_EIC_EXTINT14    ( ( PIN_PB14A_EIC_EXTINT14 << 16 ) | MUX_PB14A_EIC_EXTINT14 )
#define PORT_PB14A_EIC_EXTINT14      ( 1u << 14 )
#define PIN_PB30A_EIC_EXTINT14       62       /**< \brief EIC signal: EXTINT14 on PB30 mux A */
#define MUX_PB30A_EIC_EXTINT14       0
#define PINMUX_PB30A_EIC_EXTINT14    ( ( PIN_PB30A_EIC_EXTINT14 << 16 ) | MUX_PB30A_EIC_EXTINT14 )
#define PORT_PB30A_EIC_EXTINT14      ( 1u << 30 )
#define PIN_PA14A_EIC_EXTINT14       14       /**< \brief EIC signal: EXTINT14 on PA14 mux A */
#define MUX_PA14A_EIC_EXTINT14       0
#define PINMUX_PA14A_EIC_EXTINT14    ( ( PIN_PA14A_EIC_EXTINT14 << 16 ) | MUX_PA14A_EIC_EXTINT14 )
#define PORT_PA14A_EIC_EXTINT14      ( 1u << 14 )
#define PIN_PA27A_EIC_EXTINT15       27       /**< \brief EIC signal: EXTINT15 on PA27 mux A */
#define MUX_PA27A_EIC_EXTINT15       0
#define PINMUX_PA27A_EIC_EXTINT15    ( ( PIN_PA27A_EIC_EXTINT15 << 16 ) | MUX_PA27A_EIC_EXTINT15 )
#define PORT_PA27A_EIC_EXTINT15      ( 1u << 27 )
#define PIN_PB15A_EIC_EXTINT15       47       /**< \brief EIC signal: EXTINT15 on PB15 mux A */
#define MUX_PB15A_EIC_EXTINT15       0
#define PINMUX_PB15A_EIC_EXTINT15    ( ( PIN_PB15A_EIC_EXTINT15 << 16 ) | MUX_PB15A_EIC_EXTINT15 )
#define PORT_PB15A_EIC_EXTINT15      ( 1u << 15 )
#define PIN_PB31A_EIC_EXTINT15       63       /**< \brief EIC signal: EXTINT15 on PB31 mux A */
#define MUX_PB31A_EIC_EXTINT15       0
#define PINMUX_PB31A_EIC_EXTINT15    ( ( PIN_PB31A_EIC_EXTINT15 << 16 ) | MUX_PB31A_EIC_EXTINT15 )
#define PORT_PB31A_EIC_EXTINT15      ( 1u << 31 )
#define PIN_PA15A_EIC_EXTINT15       15       /**< \brief EIC signal: EXTINT15 on PA15 mux A */
#define MUX_PA15A_EIC_EXTINT15       0
#define PINMUX_PA15A_EIC_EXTINT15    ( ( PIN_PA15A_EIC_EXTINT15 << 16 ) | MUX_PA15A_EIC_EXTINT15 )
#define PORT_PA15A_EIC_EXTINT15      ( 1u << 15 )
#define PIN_PA08A_EIC_NMI            8        /**< \brief EIC signal: NMI on PA08 mux A */
#define MUX_PA08A_EIC_NMI            0
#define PINMUX_PA08A_EIC_NMI         ( ( PIN_PA08A_EIC_NMI << 16 ) | MUX_PA08A_EIC_NMI )
#define PORT_PA08A_EIC_NMI           ( 1u << 8 )
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0       4        /**< \brief SERCOM0 signal: PAD0 on PA04 mux D */
#define MUX_PA04D_SERCOM0_PAD0       3
#define PINMUX_PA04D_SERCOM0_PAD0    ( ( PIN_PA04D_SERCOM0_PAD0 << 16 ) | MUX_PA04D_SERCOM0_PAD0 )
#define PORT_PA04D_SERCOM0_PAD0      ( 1u << 4 )
#define PIN_PA08C_SERCOM0_PAD0       8        /**< \brief SERCOM0 signal: PAD0 on PA08 mux C */
#define MUX_PA08C_SERCOM0_PAD0       2
#define PINMUX_PA08C_SERCOM0_PAD0    ( ( PIN_PA08C_SERCOM0_PAD0 << 16 ) | MUX_PA08C_SERCOM0_PAD0 )
#define PORT_PA08C_SERCOM0_PAD0      ( 1u << 8 )
#define PIN_PA05D_SERCOM0_PAD1       5        /**< \brief SERCOM0 signal: PAD1 on PA05 mux D */
#define MUX_PA05D_SERCOM0_PAD1       3
#define PINMUX_PA05D_SERCOM0_PAD1    ( ( PIN_PA05D_SERCOM0_PAD1 << 16 ) | MUX_PA05D_SERCOM0_PAD1 )
#define PORT_PA05D_SERCOM0_PAD1      ( 1u << 5 )
#define PIN_PA09C_SERCOM0_PAD1       9        /**< \brief SERCOM0 signal: PAD1 on PA09 mux C */
#define MUX_PA09C_SERCOM0_PAD1       2
#define PINMUX_PA09C_SERCOM0_PAD1    ( ( PIN_PA09C_SERCOM0_PAD1 << 16 ) | MUX_PA09C_SERCOM0_PAD1 )
#define PORT_PA09C_SERCOM0_PAD1      ( 1u << 9 )
#define PIN_PA06D_SERCOM0_PAD2       6        /**< \brief SERCOM0 signal: PAD2 on PA06 mux D */
#define MUX_PA06D_SERCOM0_PAD2       3
#define PINMUX_PA06D_SERCOM0_PAD2    ( ( PIN_PA06D_SERCOM0_PAD2 << 16 ) | MUX_PA06D_SERCOM0_PAD2 )
#define PORT_PA06D_SERCOM0_PAD2      ( 1u << 6 )
#define PIN_PA10C_SERCOM0_PAD2       10       /**< \brief SERCOM0 signal: PAD2 on PA10 mux C */
#define MUX_PA10C_SERCOM0_PAD2       2
#define PINMUX_PA10C_SERCOM0_PAD2    ( ( PIN_PA10C_SERCOM0_PAD2 << 16 ) | MUX_PA10C_SERCOM0_PAD2 )
#define PORT_PA10C_SERCOM0_PAD2      ( 1u << 10 )
#define PIN_PA07D_SERCOM0_PAD3       7        /**< \brief SERCOM0 signal: PAD3 on PA07 mux D */
#define MUX_PA07D_SERCOM0_PAD3       3
#define PINMUX_PA07D_SERCOM0_PAD3    ( ( PIN_PA07D_SERCOM0_PAD3 << 16 ) | MUX_PA07D_SERCOM0_PAD3 )
#define PORT_PA07D_SERCOM0_PAD3      ( 1u << 7 )
#define PIN_PA11C_SERCOM0_PAD3       11       /**< \brief SERCOM0 signal: PAD3 on PA11 mux C */
#define MUX_PA11C_SERCOM0_PAD3       2
#define PINMUX_PA11C_SERCOM0_PAD3    ( ( PIN_PA11C_SERCOM0_PAD3 << 16 ) | MUX_PA11C_SERCOM0_PAD3 )
#define PORT_PA11C_SERCOM0_PAD3      ( 1u << 11 )
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PA16C_SERCOM1_PAD0       16       /**< \brief SERCOM1 signal: PAD0 on PA16 mux C */
#define MUX_PA16C_SERCOM1_PAD0       2
#define PINMUX_PA16C_SERCOM1_PAD0    ( ( PIN_PA16C_SERCOM1_PAD0 << 16 ) | MUX_PA16C_SERCOM1_PAD0 )
#define PORT_PA16C_SERCOM1_PAD0      ( 1u << 16 )
#define PIN_PA00D_SERCOM1_PAD0       0        /**< \brief SERCOM1 signal: PAD0 on PA00 mux D */
#define MUX_PA00D_SERCOM1_PAD0       3
#define PINMUX_PA00D_SERCOM1_PAD0    ( ( PIN_PA00D_SERCOM1_PAD0 << 16 ) | MUX_PA00D_SERCOM1_PAD0 )
#define PORT_PA00D_SERCOM1_PAD0      ( 1u << 0 )
#define PIN_PA17C_SERCOM1_PAD1       17       /**< \brief SERCOM1 signal: PAD1 on PA17 mux C */
#define MUX_PA17C_SERCOM1_PAD1       2
#define PINMUX_PA17C_SERCOM1_PAD1    ( ( PIN_PA17C_SERCOM1_PAD1 << 16 ) | MUX_PA17C_SERCOM1_PAD1 )
#define PORT_PA17C_SERCOM1_PAD1      ( 1u << 17 )
#define PIN_PA01D_SERCOM1_PAD1       1        /**< \brief SERCOM1 signal: PAD1 on PA01 mux D */
#define MUX_PA01D_SERCOM1_PAD1       3
#define PINMUX_PA01D_SERCOM1_PAD1    ( ( PIN_PA01D_SERCOM1_PAD1 << 16 ) | MUX_PA01D_SERCOM1_PAD1 )
#define PORT_PA01D_SERCOM1_PAD1      ( 1u << 1 )
#define PIN_PA30D_SERCOM1_PAD2       30       /**< \brief SERCOM1 signal: PAD2 on PA30 mux D */
#define MUX_PA30D_SERCOM1_PAD2       3
#define PINMUX_PA30D_SERCOM1_PAD2    ( ( PIN_PA30D_SERCOM1_PAD2 << 16 ) | MUX_PA30D_SERCOM1_PAD2 )
#define PORT_PA30D_SERCOM1_PAD2      ( 1u << 30 )
#define PIN_PA18C_SERCOM1_PAD2       18       /**< \brief SERCOM1 signal: PAD2 on PA18 mux C */
#define MUX_PA18C_SERCOM1_PAD2       2
#define PINMUX_PA18C_SERCOM1_PAD2    ( ( PIN_PA18C_SERCOM1_PAD2 << 16 ) | MUX_PA18C_SERCOM1_PAD2 )
#define PORT_PA18C_SERCOM1_PAD2      ( 1u << 18 )
#define PIN_PA31D_SERCOM1_PAD3       31       /**< \brief SERCOM1 signal: PAD3 on PA31 mux D */
#define MUX_PA31D_SERCOM1_PAD3       3
#define PINMUX_PA31D_SERCOM1_PAD3    ( ( PIN_PA31D_SERCOM1_PAD3 << 16 ) | MUX_PA31D_SERCOM1_PAD3 )
#define PORT_PA31D_SERCOM1_PAD3      ( 1u << 31 )
#define PIN_PA19C_SERCOM1_PAD3       19       /**< \brief SERCOM1 signal: PAD3 on PA19 mux C */
#define MUX_PA19C_SERCOM1_PAD3       2
#define PINMUX_PA19C_SERCOM1_PAD3    ( ( PIN_PA19C_SERCOM1_PAD3 << 16 ) | MUX_PA19C_SERCOM1_PAD3 )
#define PORT_PA19C_SERCOM1_PAD3      ( 1u << 19 )
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA08D_SERCOM2_PAD0       8        /**< \brief SERCOM2 signal: PAD0 on PA08 mux D */
#define MUX_PA08D_SERCOM2_PAD0       3
#define PINMUX_PA08D_SERCOM2_PAD0    ( ( PIN_PA08D_SERCOM2_PAD0 << 16 ) | MUX_PA08D_SERCOM2_PAD0 )
#define PORT_PA08D_SERCOM2_PAD0      ( 1u << 8 )
#define PIN_PA12C_SERCOM2_PAD0       12       /**< \brief SERCOM2 signal: PAD0 on PA12 mux C */
#define MUX_PA12C_SERCOM2_PAD0       2
#define PINMUX_PA12C_SERCOM2_PAD0    ( ( PIN_PA12C_SERCOM2_PAD0 << 16 ) | MUX_PA12C_SERCOM2_PAD0 )
#define PORT_PA12C_SERCOM2_PAD0      ( 1u << 12 )
#define PIN_PA09D_SERCOM2_PAD1       9        /**< \brief SERCOM2 signal: PAD1 on PA09 mux D */
#define MUX_PA09D_SERCOM2_PAD1       3
#define PINMUX_PA09D_SERCOM2_PAD1    ( ( PIN_PA09D_SERCOM2_PAD1 << 16 ) | MUX_PA09D_SERCOM2_PAD1 )
#define PORT_PA09D_SERCOM2_PAD1      ( 1u << 9 )
#define PIN_PA13C_SERCOM2_PAD1       13       /**< \brief SERCOM2 signal: PAD1 on PA13 mux C */
#define MUX_PA13C_SERCOM2_PAD1       2
#define PINMUX_PA13C_SERCOM2_PAD1    ( ( PIN_PA13C_SERCOM2_PAD1 << 16 ) | MUX_PA13C_SERCOM2_PAD1 )
#define PORT_PA13C_SERCOM2_PAD1      ( 1u << 13 )
#define PIN_PA10D_SERCOM2_PAD2       10       /**< \brief SERCOM2 signal: PAD2 on PA10 mux D */
#define MUX_PA10D_SERCOM2_PAD2       3
#define PINMUX_PA10D_SERCOM2_PAD2    ( ( PIN_PA10D_SERCOM2_PAD2 << 16 ) | MUX_PA10D_SERCOM2_PAD2 )
#define PORT_PA10D_SERCOM2_PAD2      ( 1u << 10 )
#define PIN_PA14C_SERCOM2_PAD2       14       /**< \brief SERCOM2 signal: PAD2 on PA14 mux C */
#define MUX_PA14C_SERCOM2_PAD2       2
#define PINMUX_PA14C_SERCOM2_PAD2    ( ( PIN_PA14C_SERCOM2_PAD2 << 16 ) | MUX_PA14C_SERCOM2_PAD2 )
#define PORT_PA14C_SERCOM2_PAD2      ( 1u << 14 )
#define PIN_PA11D_SERCOM2_PAD3       11       /**< \brief SERCOM2 signal: PAD3 on PA11 mux D */
#define MUX_PA11D_SERCOM2_PAD3       3
#define PINMUX_PA11D_SERCOM2_PAD3    ( ( PIN_PA11D_SERCOM2_PAD3 << 16 ) | MUX_PA11D_SERCOM2_PAD3 )
#define PORT_PA11D_SERCOM2_PAD3      ( 1u << 11 )
#define PIN_PA15C_SERCOM2_PAD3       15       /**< \brief SERCOM2 signal: PAD3 on PA15 mux C */
#define MUX_PA15C_SERCOM2_PAD3       2
#define PINMUX_PA15C_SERCOM2_PAD3    ( ( PIN_PA15C_SERCOM2_PAD3 << 16 ) | MUX_PA15C_SERCOM2_PAD3 )
#define PORT_PA15C_SERCOM2_PAD3      ( 1u << 15 )
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA16D_SERCOM3_PAD0       16       /**< \brief SERCOM3 signal: PAD0 on PA16 mux D */
#define MUX_PA16D_SERCOM3_PAD0       3
#define PINMUX_PA16D_SERCOM3_PAD0    ( ( PIN_PA16D_SERCOM3_PAD0 << 16 ) | MUX_PA16D_SERCOM3_PAD0 )
#define PORT_PA16D_SERCOM3_PAD0      ( 1u << 16 )
#define PIN_PA22C_SERCOM3_PAD0       22       /**< \brief SERCOM3 signal: PAD0 on PA22 mux C */
#define MUX_PA22C_SERCOM3_PAD0       2
#define PINMUX_PA22C_SERCOM3_PAD0    ( ( PIN_PA22C_SERCOM3_PAD0 << 16 ) | MUX_PA22C_SERCOM3_PAD0 )
#define PORT_PA22C_SERCOM3_PAD0      ( 1u << 22 )
#define PIN_PA17D_SERCOM3_PAD1       17       /**< \brief SERCOM3 signal: PAD1 on PA17 mux D */
#define MUX_PA17D_SERCOM3_PAD1       3
#define PINMUX_PA17D_SERCOM3_PAD1    ( ( PIN_PA17D_SERCOM3_PAD1 << 16 ) | MUX_PA17D_SERCOM3_PAD1 )
#define PORT_PA17D_SERCOM3_PAD1      ( 1u << 17 )
#define PIN_PA23C_SERCOM3_PAD1       23       /**< \brief SERCOM3 signal: PAD1 on PA23 mux C */
#define MUX_PA23C_SERCOM3_PAD1       2
#define PINMUX_PA23C_SERCOM3_PAD1    ( ( PIN_PA23C_SERCOM3_PAD1 << 16 ) | MUX_PA23C_SERCOM3_PAD1 )
#define PORT_PA23C_SERCOM3_PAD1      ( 1u << 23 )
#define PIN_PA18D_SERCOM3_PAD2       18       /**< \brief SERCOM3 signal: PAD2 on PA18 mux D */
#define MUX_PA18D_SERCOM3_PAD2       3
#define PINMUX_PA18D_SERCOM3_PAD2    ( ( PIN_PA18D_SERCOM3_PAD2 << 16 ) | MUX_PA18D_SERCOM3_PAD2 )
#define PORT_PA18D_SERCOM3_PAD2      ( 1u << 18 )
#define PIN_PA20D_SERCOM3_PAD2       20       /**< \brief SERCOM3 signal: PAD2 on PA20 mux D */
#define MUX_PA20D_SERCOM3_PAD2       3
#define PINMUX_PA20D_SERCOM3_PAD2    ( ( PIN_PA20D_SERCOM3_PAD2 << 16 ) | MUX_PA20D_SERCOM3_PAD2 )
#define PORT_PA20D_SERCOM3_PAD2      ( 1u << 20 )
#define PIN_PA24C_SERCOM3_PAD2       24       /**< \brief SERCOM3 signal: PAD2 on PA24 mux C */
#define MUX_PA24C_SERCOM3_PAD2       2
#define PINMUX_PA24C_SERCOM3_PAD2    ( ( PIN_PA24C_SERCOM3_PAD2 << 16 ) | MUX_PA24C_SERCOM3_PAD2 )
#define PORT_PA24C_SERCOM3_PAD2      ( 1u << 24 )
#define PIN_PA19D_SERCOM3_PAD3       19       /**< \brief SERCOM3 signal: PAD3 on PA19 mux D */
#define MUX_PA19D_SERCOM3_PAD3       3
#define PINMUX_PA19D_SERCOM3_PAD3    ( ( PIN_PA19D_SERCOM3_PAD3 << 16 ) | MUX_PA19D_SERCOM3_PAD3 )
#define PORT_PA19D_SERCOM3_PAD3      ( 1u << 19 )
#define PIN_PA21D_SERCOM3_PAD3       21       /**< \brief SERCOM3 signal: PAD3 on PA21 mux D */
#define MUX_PA21D_SERCOM3_PAD3       3
#define PINMUX_PA21D_SERCOM3_PAD3    ( ( PIN_PA21D_SERCOM3_PAD3 << 16 ) | MUX_PA21D_SERCOM3_PAD3 )
#define PORT_PA21D_SERCOM3_PAD3      ( 1u << 21 )
#define PIN_PA25C_SERCOM3_PAD3       25       /**< \brief SERCOM3 signal: PAD3 on PA25 mux C */
#define MUX_PA25C_SERCOM3_PAD3       2
#define PINMUX_PA25C_SERCOM3_PAD3    ( ( PIN_PA25C_SERCOM3_PAD3 << 16 ) | MUX_PA25C_SERCOM3_PAD3 )
#define PORT_PA25C_SERCOM3_PAD3      ( 1u << 25 )
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA12D_SERCOM4_PAD0       12       /**< \brief SERCOM4 signal: PAD0 on PA12 mux D */
#define MUX_PA12D_SERCOM4_PAD0       3
#define PINMUX_PA12D_SERCOM4_PAD0    ( ( PIN_PA12D_SERCOM4_PAD0 << 16 ) | MUX_PA12D_SERCOM4_PAD0 )
#define PORT_PA12D_SERCOM4_PAD0      ( 1u << 12 )
#define PIN_PB08D_SERCOM4_PAD0       40       /**< \brief SERCOM4 signal: PAD0 on PB08 mux D */
#define MUX_PB08D_SERCOM4_PAD0       3
#define PINMUX_PB08D_SERCOM4_PAD0    ( ( PIN_PB08D_SERCOM4_PAD0 << 16 ) | MUX_PB08D_SERCOM4_PAD0 )
#define PORT_PB08D_SERCOM4_PAD0      ( 1u << 8 )
#define PIN_PB12C_SERCOM4_PAD0       44       /**< \brief SERCOM4 signal: PAD0 on PB12 mux C */
#define MUX_PB12C_SERCOM4_PAD0       2
#define PINMUX_PB12C_SERCOM4_PAD0    ( ( PIN_PB12C_SERCOM4_PAD0 << 16 ) | MUX_PB12C_SERCOM4_PAD0 )
#define PORT_PB12C_SERCOM4_PAD0      ( 1u << 12 )
#define PIN_PA13D_SERCOM4_PAD1       13       /**< \brief SERCOM4 signal: PAD1 on PA13 mux D */
#define MUX_PA13D_SERCOM4_PAD1       3
#define PINMUX_PA13D_SERCOM4_PAD1    ( ( PIN_PA13D_SERCOM4_PAD1 << 16 ) | MUX_PA13D_SERCOM4_PAD1 )
#define PORT_PA13D_SERCOM4_PAD1      ( 1u << 13 )
#define PIN_PB09D_SERCOM4_PAD1       41       /**< \brief SERCOM4 signal: PAD1 on PB09 mux D */
#define MUX_PB09D_SERCOM4_PAD1       3
#define PINMUX_PB09D_SERCOM4_PAD1    ( ( PIN_PB09D_SERCOM4_PAD1 << 16 ) | MUX_PB09D_SERCOM4_PAD1 )
#define PORT_PB09D_SERCOM4_PAD1      ( 1u << 9 )
#define PIN_PB13C_SERCOM4_PAD1       45       /**< \brief SERCOM4 signal: PAD1 on PB13 mux C */
#define MUX_PB13C_SERCOM4_PAD1       2
#define PINMUX_PB13C_SERCOM4_PAD1    ( ( PIN_PB13C_SERCOM4_PAD1 << 16 ) | MUX_PB13C_SERCOM4_PAD1 )
#define PORT_PB13C_SERCOM4_PAD1      ( 1u << 13 )
#define PIN_PA14D_SERCOM4_PAD2       14       /**< \brief SERCOM4 signal: PAD2 on PA14 mux D */
#define MUX_PA14D_SERCOM4_PAD2       3
#define PINMUX_PA14D_SERCOM4_PAD2    ( ( PIN_PA14D_SERCOM4_PAD2 << 16 ) | MUX_PA14D_SERCOM4_PAD2 )
#define PORT_PA14D_SERCOM4_PAD2      ( 1u << 14 )
#define PIN_PB10D_SERCOM4_PAD2       42       /**< \brief SERCOM4 signal: PAD2 on PB10 mux D */
#define MUX_PB10D_SERCOM4_PAD2       3
#define PINMUX_PB10D_SERCOM4_PAD2    ( ( PIN_PB10D_SERCOM4_PAD2 << 16 ) | MUX_PB10D_SERCOM4_PAD2 )
#define PORT_PB10D_SERCOM4_PAD2      ( 1u << 10 )
#define PIN_PB14C_SERCOM4_PAD2       46       /**< \brief SERCOM4 signal: PAD2 on PB14 mux C */
#define MUX_PB14C_SERCOM4_PAD2       2
#define PINMUX_PB14C_SERCOM4_PAD2    ( ( PIN_PB14C_SERCOM4_PAD2 << 16 ) | MUX_PB14C_SERCOM4_PAD2 )
#define PORT_PB14C_SERCOM4_PAD2      ( 1u << 14 )
#define PIN_PA15D_SERCOM4_PAD3       15       /**< \brief SERCOM4 signal: PAD3 on PA15 mux D */
#define MUX_PA15D_SERCOM4_PAD3       3
#define PINMUX_PA15D_SERCOM4_PAD3    ( ( PIN_PA15D_SERCOM4_PAD3 << 16 ) | MUX_PA15D_SERCOM4_PAD3 )
#define PORT_PA15D_SERCOM4_PAD3      ( 1u << 15 )
#define PIN_PB11D_SERCOM4_PAD3       43       /**< \brief SERCOM4 signal: PAD3 on PB11 mux D */
#define MUX_PB11D_SERCOM4_PAD3       3
#define PINMUX_PB11D_SERCOM4_PAD3    ( ( PIN_PB11D_SERCOM4_PAD3 << 16 ) | MUX_PB11D_SERCOM4_PAD3 )
#define PORT_PB11D_SERCOM4_PAD3      ( 1u << 11 )
#define PIN_PB15C_SERCOM4_PAD3       47       /**< \brief SERCOM4 signal: PAD3 on PB15 mux C */
#define MUX_PB15C_SERCOM4_PAD3       2
#define PINMUX_PB15C_SERCOM4_PAD3    ( ( PIN_PB15C_SERCOM4_PAD3 << 16 ) | MUX_PB15C_SERCOM4_PAD3 )
#define PORT_PB15C_SERCOM4_PAD3      ( 1u << 15 )
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA22D_SERCOM5_PAD0       22       /**< \brief SERCOM5 signal: PAD0 on PA22 mux D */
#define MUX_PA22D_SERCOM5_PAD0       3
#define PINMUX_PA22D_SERCOM5_PAD0    ( ( PIN_PA22D_SERCOM5_PAD0 << 16 ) | MUX_PA22D_SERCOM5_PAD0 )
#define PORT_PA22D_SERCOM5_PAD0      ( 1u << 22 )
#define PIN_PB02D_SERCOM5_PAD0       34       /**< \brief SERCOM5 signal: PAD0 on PB02 mux D */
#define MUX_PB02D_SERCOM5_PAD0       3
#define PINMUX_PB02D_SERCOM5_PAD0    ( ( PIN_PB02D_SERCOM5_PAD0 << 16 ) | MUX_PB02D_SERCOM5_PAD0 )
#define PORT_PB02D_SERCOM5_PAD0      ( 1u << 2 )
#define PIN_PB30D_SERCOM5_PAD0       62       /**< \brief SERCOM5 signal: PAD0 on PB30 mux D */
#define MUX_PB30D_SERCOM5_PAD0       3
#define PINMUX_PB30D_SERCOM5_PAD0    ( ( PIN_PB30D_SERCOM5_PAD0 << 16 ) | MUX_PB30D_SERCOM5_PAD0 )
#define PORT_PB30D_SERCOM5_PAD0      ( 1u << 30 )
#define PIN_PB16C_SERCOM5_PAD0       48       /**< \brief SERCOM5 signal: PAD0 on PB16 mux C */
#define MUX_PB16C_SERCOM5_PAD0       2
#define PINMUX_PB16C_SERCOM5_PAD0    ( ( PIN_PB16C_SERCOM5_PAD0 << 16 ) | MUX_PB16C_SERCOM5_PAD0 )
#define PORT_PB16C_SERCOM5_PAD0      ( 1u << 16 )
#define PIN_PA23D_SERCOM5_PAD1       23       /**< \brief SERCOM5 signal: PAD1 on PA23 mux D */
#define MUX_PA23D_SERCOM5_PAD1       3
#define PINMUX_PA23D_SERCOM5_PAD1    ( ( PIN_PA23D_SERCOM5_PAD1 << 16 ) | MUX_PA23D_SERCOM5_PAD1 )
#define PORT_PA23D_SERCOM5_PAD1      ( 1u << 23 )
#define PIN_PB03D_SERCOM5_PAD1       35       /**< \brief SERCOM5 signal: PAD1 on PB03 mux D */
#define MUX_PB03D_SERCOM5_PAD1       3
#define PINMUX_PB03D_SERCOM5_PAD1    ( ( PIN_PB03D_SERCOM5_PAD1 << 16 ) | MUX_PB03D_SERCOM5_PAD1 )
#define PORT_PB03D_SERCOM5_PAD1      ( 1u << 3 )
#define PIN_PB31D_SERCOM5_PAD1       63       /**< \brief SERCOM5 signal: PAD1 on PB31 mux D */
#define MUX_PB31D_SERCOM5_PAD1       3
#define PINMUX_PB31D_SERCOM5_PAD1    ( ( PIN_PB31D_SERCOM5_PAD1 << 16 ) | MUX_PB31D_SERCOM5_PAD1 )
#define PORT_PB31D_SERCOM5_PAD1      ( 1u << 31 )
#define PIN_PB17C_SERCOM5_PAD1       49       /**< \brief SERCOM5 signal: PAD1 on PB17 mux C */
#define MUX_PB17C_SERCOM5_PAD1       2
#define PINMUX_PB17C_SERCOM5_PAD1    ( ( PIN_PB17C_SERCOM5_PAD1 << 16 ) | MUX_PB17C_SERCOM5_PAD1 )
#define PORT_PB17C_SERCOM5_PAD1      ( 1u << 17 )
#define PIN_PA24D_SERCOM5_PAD2       24       /**< \brief SERCOM5 signal: PAD2 on PA24 mux D */
#define MUX_PA24D_SERCOM5_PAD2       3
